# Chapter 2 - Data Preparation Basics
## Segment 3 - Removing duplicates

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

### Removing duplicates

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        D
6         3        c        C

In [6]:
# object_name.drop_duplicates(['column_name'])
# ( WHAT THIS DOES )
# To drop the rows that have duplicates in only one column Series, just call the drop_duplicates() 
# method off of the DataFrame, and pass in the label-index of the column you want the de-duplication 
# to be based on. This method will drops all rows that have duplicates in the column you specify.
DF_obj.drop_duplicates(['column 3'])

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C
5         3        c        D

And just as we predicted, it dropped the rows that had the series index values one, three, and six, now we have no duplicates in column three. Now that I've shown you how to drop duplicates from your data, I just want to highlight the point that it's really important that you check your data for duplicates, and remove them if you find them. Now, it's time to move on, to data concatenation and transformation.